package com.example.kahani;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.LinearLayoutManager;

import android.os.Bundle;

import com.example.kahani.Adapters.SpecificSoriesAdapter;
import com.example.kahani.Models.SpecificStoriesModel;
import com.example.kahani.databinding.ActivityMysteryBinding;

import java.util.ArrayList;

public class Mystery extends AppCompatActivity
{
ActivityMysteryBinding binding;
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        binding = ActivityMysteryBinding.inflate(getLayoutInflater());
        setContentView(binding.getRoot());

        getSupportActionBar().hide();

        ArrayList<SpecificStoriesModel> arrayList = new ArrayList<>();
        String str1="एक बार कंस ने पूतना नाम की राक्षसी को बाल कृष्ण का वध करने के लिए भेजा। जैसे ही पूतना गोकुल पहुंची, उसने एक सुंदर स्त्री का रूप धारण कर लिया। स्त्री का रूप धारण कर पूतना घर-घर जाकर कृष्ण की तलाश करने लगी। कृष्ण की खोज में पूतना को जो भी बालक मिलता, वो उसे अपने विष वाले दूध को पिलाकर मार देती।" +
                "जब पूतना कृष्ण के घर पहुंचती है, तब भगवान कृष्ण को पता चल जाता है कि वह एक राक्षसी है। पूतना कृष्ण को गोदी में उठाकर अपना विषैला दूध पिलाने लगती है। कृष्ण को दूध पीते देखकर पूतना सोचने लगती है कि अब यह मर जाएगा। भगवान कृष्ण कुछ देर बाद दूध पीते-पीते ही राक्षसी के प्राण खींचने लगते हैं। दर्द के कारण राक्षसी पूतना कृष्ण को आसमान की ओर लेकर उड़ जाती है और पास के जंगल में कान्हा सहित गिर जाती है। थोड़ी देर बाद ही राक्षसी के प्राण निकल जाते हैं। इस तरह भगवान कृष्ण राक्षसी पूतना का वध कर देते हैं।";

        String str2="यह अलादीन और जादुई चिराग की लघुकथा है। एक बार की बात है, अलादीन नाम का एक लड़का बहुत दूर पूर्व में रहता था। वह अपनी मां के साथ रहता था और बाजार में फल बेचकर उसका भरण-पोषण करता था। एक दिन महल का जादूगर उसकी तलाश में बाजार आया। \"मेरे साथ आओ अलादीन, मेरे पास तुम्हें दिखाने के लिए कुछ है\", उसने कहा। वह उसके साथ चला गया। जादूगर उसे गहरे रेगिस्तान में ले गया। वे एक विशाल चट्टान से अवरुद्ध एक विशाल गुफा के मुहाने पर पहुँचे। जादूगर रुक गया और जादू करने लगा। \"साला, साला! लाल शिमला मिर्च! अलबरा!\", जादूगर ने कहा जिससे विशाल चट्टान अपने आप हट गई। अलादीन बहुत हैरान था। \"गुफा में जाओ और मेरे लिए सोने का दीपक लाओ जो तुम्हें वहां मिलेगा। दीये के सिवा कुछ न छुओ!\" जादूगर ने कहा। गुफा में अंधेरा होने के कारण वह डर गया था। जादूगर ने उसकी झिझक को देखा और उसे एक बड़े रत्न के साथ एक अंगूठी सौंपी। जादूगर ने कहा, \"यह अंगूठी लो, अगर कुछ भी गलत होता है तो यह आपकी रक्षा करेगी।\" वह भीतर चला गया। चमचमाते रत्नों और सोने के सिक्कों से भरी हुई गुफा। खजाने से लदे एक पेड़ के नीचे एक पुराना दीपक खड़ा था। \"यह होना चाहिए! लेकिन वह इतना पुराना और बेकार कुछ क्यों चाहेगा? मुझे अपनी माँ के लिए भी एक लेना चाहिए,\" उसने सोचा। जैसे ही अलादीन ने खजाना छीन लिया, पूरी गुफा एक गड़गड़ाहट की आवाज के साथ कांपने लगी। वह जादू का दीपक लेकर गुफा के मुहाने की ओर भागा। उसने जादूगर से मदद मांगी लेकिन वह सिर्फ दीपक चाहता था और उसे फेंकने के लिए कहा। प्रवेश और निकास का रास्ता अब बंद कर दिया गया था। वह अँधेरे में बिलकुल अकेला रह गया था, डरा हुआ था। \"यहाँ बहुत अंधेरा और ठंडा है! मैं अपनी माँ के घर जाना चाहता हूँ”, वह रोया। उसने उस रत्न को उस अंगूठी पर रगड़ा जो जादूगर ने उसे दी थी और अचानक वह चमकने लगा जब तक कि प्रकाश से गुफा भर नहीं गई। तेज रोशनी चली गई और उसे घर ले गई। दंग रह गए, जैसे ही उन्होंने अंगूठी को देखा और देखा कि रत्न गायब हो गया था। अलादीन ने अपनी मां को गुफा में अपने साहसिक कार्य के बारे में और जादूगर और उसकी अंगूठी के बारे में बताया। \"माँ, जादुई चिराग पर एक नज़र डालें\", उन्होंने कहा। उसकी माँ ने उसे रगड़ा और अचानक, कुछ अविश्वसनीय हुआ। एक जिन्न प्रकट हुआ और उससे एक इच्छा मांगी। वह डरा हुआ था लेकिन उत्साहित था कि जिन्न उसे एक इच्छा दे सकता है। उसने उसे महल के समान कुछ स्वादिष्ट भोजन लाने की आज्ञा दी। कुछ ही पलों में उसके सामने स्वादिष्ट व्यंजनों से लदी एक मेज दिखाई दी।" +
                "जिन्न के जादू ने अलादीन को बहुत अमीर बना दिया। एक दिन, वह शानदार उपहार और खजाने के साथ सुल्तान के पास आया। \"महाराज, मैं आपकी बेटी की शादी में हाथ मांगने आया हूं\", उन्होंने कहा। सुल्तान बहुत प्रसन्न हुआ, लेकिन राजकुमारी उसके खजाने से प्रभावित नहीं हुई। वह निराश था और सुंदर राजकुमारी को छोड़ना नहीं चाहता था। उसने जिन्न से उसकी मदद करने को कहा और फिर जिन्न ने एक जादुई कालीन बनाया। जादूगर, जो उसे पूरे कमरे से देख रहा था, समझ गया कि उसके पास जादुई चिराग है। सुल्तान की ओर मुड़ते हुए, उसने उसे अलादीन को एक नया महल बनाने का आदेश देने के लिए कहा क्योंकि वह राजकुमारी को अपने जादुई कालीन पर आकाश के माध्यम से सवारी पर ले गया, और उनके पास एक अद्भुत समय था। उसकी दयालुता और उसके द्वारा दिखाए गए सौंदर्य से प्रभावित होकर, राजकुमारी ने उसके लिए अपना दिल खोलने का फैसला किया। जैसे ही वह राजकुमारी के साथ अपनी जादुई कालीन की सवारी से लौटा, सुल्तान ने उसे एक महल बनाने का आदेश दिया। अलादीन ने जादुई चिराग को रगड़ा और जिन्न से पूछा कि क्या वह उसके लिए महल बना सकता है। जिन्न मान गया और कुछ ही मिनटों में उसने अपने मालिक के लिए एक सुंदर महल बना दिया। अलादीन अब राजकुमारी से शादी करने में सक्षम था। हालाँकि, जादूगर अभी भी दुखी था। उसे लगा कि जादू का दीपक उसका होना चाहिए था और अलादीन ने उससे चुरा लिया था।" +
                "एक दिन, जादूगर अलादीन के महल का दौरा करने आया, जब अलादीन खुद शिकार कर रहा था। उसने खुद को एक व्यापारी के रूप में प्रच्छन्न किया और अपने सिर के चारों ओर एक पगड़ी बांध ली। “मैं पुराने लैंप खरीदता हूँ! मैं एक पुराने दीपक को नए से बदल सकता हूँ”, जादूगर ने कहा। राजकुमारी ने नए के साथ जादुई दीपक का आदान-प्रदान किया। जादूगर की दुष्ट योजना ने पूरी तरह से काम किया। अब जब उसके पास दीया था, तो वह उसका उपयोग राजकुमारी और अलादीन के महल को अपने लिए लेने के लिए करना चाहता था। उसने जिन्न को अलादीन का महल लेने और राजकुमारी के साथ एक दूर के रेगिस्तान में ले जाने का आदेश दिया। जब अलादीन घर लौटा, तो वह यह देखकर चौंक गया कि सब कुछ गायब हो गया है। उसकी माँ अभी बाजार से वापस आई थी और बहुत भ्रमित और चकित थी। अलादीन ने राजकुमारी को दूर-दूर तक खोजा। अंत में, उसने सुना कि जादूगर अब राजकुमारी के साथ अपने महल में रेगिस्तान में रह रहा है। राजकुमारी ने अलादीन को देखकर उसे गले लगा लिया और उसे सारी बात बता दी। अलादीन और राजकुमारी ने चुपके से जादूगर की शराब में नींद की गोली डाल दी। जैसे ही जादूगर सोने के लिए चला गया, अलादीन ने उसकी बेल्ट से जादू का दीपक छीन लिया और उसे रगड़ दिया। उसने जिन्न को महल को वापस वहीं ले जाने का आदेश दिया जहां वह था और जादूगर को रेगिस्तान में अकेला छोड़ दिया।" +
                "एक दिन अलादीन जादू का दीया समुद्र के किनारे ले आया और उसे रगड़ा। जिन्न ने अलादीन से उसकी इच्छा पूछी। अलादीन ने कहा, \"आपने मेरी बहुत सारी इच्छाएं पूरी की हैं। मैं तुम्हें मुक्त करके तुम्हें चुकाना चाहता हूं।\" \"मेरे अनेकों, अनेक गुरुओं में से किसी ने भी कभी मेरे लिए कुछ नहीं चाहा! तुम बहुत दयालु हो!\", जिन्न रोया। जिन्न मुक्त हो गया और अलादीन ने खाली जादू का दीपक समुद्र में फेंक दिया और ईर्ष्या या लालच के बिना खुशी और प्रेम में अपने दिन व्यतीत किए। अंत में, अलादीन और जादुई चिराग की कहानी का सुखद अंत हुआ।";

        String str3="हमें क्षमा करें, कहाणी उपलब्ध नही है";
        String str4="हमें क्षमा करें, कहाणी उपलब्ध नही है";
        String str5="हमें क्षमा करें, कहाणी उपलब्ध नही है";

        String video1="https://api.vadoo.tv/landing_page?vid=Gwo2HRziukHnQl4GWve9dJRnpgpO9xZq";
        String video2="https://api.vadoo.tv/landing_page?vid=V6qBES9uHPS8epXJykmc6NXEhOoCAB49";
        String video3="https://api.vadoo.tv/landing_page?vid=iLRyarL7DCpjdk64deLskImdkqL3UZa9";
        String video4="https://api.vadoo.tv/landing_page?vid=ozHidmjUEfRuzCt5BgNjc2MYWwL7dzSJ";
        String video5="https://api.vadoo.tv/landing_page?vid=8xpAAudpoDr1dJHkRCRkKCs68fcp4fB5";

        arrayList.add(new SpecificStoriesModel("कृष्णा और पूतना",R.drawable.krishnaa,str1,video1));
        arrayList.add(new SpecificStoriesModel("अलादीन और जादू का चिराग",R.drawable.aladin,str2,video2));
        arrayList.add(new SpecificStoriesModel("रहस्यमय जादुई बुक",R.drawable.book,str3,video3));
        arrayList.add(new SpecificStoriesModel("रहस्यमय टापू",R.drawable.tapu,str4,video4));
        arrayList.add(new SpecificStoriesModel("लाल पहाड़ी का रहस्य",R.drawable.pahad,str5,video5));

        SpecificSoriesAdapter specificSoriesAdapter = new SpecificSoriesAdapter(arrayList,this);

        LinearLayoutManager linearLayoutManager = new LinearLayoutManager(this,LinearLayoutManager.VERTICAL,true);
        binding.mysteryRecyclerView.setLayoutManager(linearLayoutManager);
        binding.mysteryRecyclerView.setAdapter(specificSoriesAdapter);

    }
}