package com.example.kahani;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.LinearLayoutManager;

import android.os.Bundle;

import com.example.kahani.Adapters.SpecificSoriesAdapter;
import com.example.kahani.Models.SpecificStoriesModel;
import com.example.kahani.databinding.ActivityMythologicalBinding;

import java.util.ArrayList;

public class Mythological extends AppCompatActivity
{
    ActivityMythologicalBinding binding;
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        binding = ActivityMythologicalBinding.inflate(getLayoutInflater());
        setContentView(binding.getRoot());

        getSupportActionBar().hide();

        ArrayList<SpecificStoriesModel> arrayList = new ArrayList<>();

        //-----------------------------------------------------------------------
        String str1="पौराणिक कथा के अनुसार, हिरण्यकश्यप को ब्रह्माजी से वरदान प्राप्त था कि वह न तो किसी मनुष्य द्वारा मारा जा सके न ही किसी पशु द्वारा। न दिन में मारा जा सके, न रात में, न जमींन पर मारा जा सके, न आसमान में। इस वरदान के नशे में आकर उसके अंदर अहंकार आ गया। जिसके बाद उसने इंद्र देव का राज्य छीन लिया और तीनों लोक में रहने वाले लोगों को प्रताड़ित करना शुरू कर दिया। उसने घोषणा कर दी कि मैं ही इस पूरे संसार का भगवान हूं और सभी मेरी पूजा करो।उधर, हिरण्कश्यप के स्वभाव से विपरीत उसका पुत्र प्रहलाद भगवान विष्णु का बहुत बड़ा भक्त था। पिता के लाख मना करने और प्रताड़ित करने के बाद भी वह भगवान विष्णु की पूजा करता रहा। जब प्रहला ने अपने पिता हिरण्यकश्यप की बात नहीं मानी तो उसने अपने ही बेटे को पहाड़ से धकेल कर मारने की कोशिश कि, लेकिन भगवान विष्णु ने अपने भक्त प्रहलाद की जान बचा ली। इसके बाद हिरण्कश्यप ने प्रहलाद को जिंदा जलाने की नाकाम कोशिश की।अंत में क्रोधित हिरण्कश्यप ने अपने पुत्र प्रहलाद को दीवार में बांध कर आग लगा दी और बोला बता तेरा भगवान कहां है, प्रहलाद ने बताया कि भगवान यहीं हैं, जहां आपने मुझे बांध रखा है। जैसे ही हिरण्कश्यप अपने गदे से प्रह्लाद को मारना चाहा, वैसे ही भगवान विष्णु नरसिंह का अवतार लेकर खंभे से बाहर निकल आए और हिरण्कश्यप का वध कर दिया। जिस दिन भगवान नृसिंह ने हिरण्यकश्यप का वध करके भक्त प्रहलाद के जीवन की रक्षा की, उस दिन को नरसिंह जयंती के रूप में मनाया जाता है।";

        String str2="विष्णु पुराण के अनुसार, चिरकाल में बालक ध्रुव ब्रह्मा जी के पुत्र मनु के पोते थे। इनके पिता का नाम राजा उतान्पाद था। राजा उतान्पाद ने दो शादियां की थीं। एक पत्नी का नाम सुनीति और दूसरे का नाम सुरुचि था। बालक ध्रुव सुनीति की संतान था। सुरुचि चाहती थी कि उसका पुत्र उत्तम उत्तराधिकारी बने।एक दिन जब ध्रुव अपने पिता की गोद में जाकर बैठ गया तो सुरुचि ने यह कहकर उसे गोद से उतार दिया कि तुम इसके लायक नहीं हो! इससे ध्रुव अत्यंत दुखी हो उठे।इसके बाद वह अपनी मां के पास जाकर बोले- हे माते! मुझे पिता की गोद में बैठने क्यों नहीं दिया गया? तब सुनीति ने कहा कि बेटे अगर गोद में ही बैठना है तो प्रभु की गोद में बैठो। वे सबके पिता हैं। इसके लिए तुम्हें कठिन तप करना होगा। यह सुन ध्रुव वन की ओर गमन कर गए। यह जान नारद जी ने उन्हें वन में रोका और लौट जाने की बात कही, लेकिन ध्रुव नहीं माने।ध्रुव ने ६ महीने तक कठिन तपस्या कीअंत में नारद जी ने उन्हें ॐ नमो भगवते वासुदेवाय नमः मंत्र जाप करने की विधि बताई। इसके बाद ध्रुव ने ६ महीने तक कठिन तपस्या की। तब भगवान श्रीहरि विष्णु जी प्रकट होकर बोले-हे वत्स! मैं तुम्हारी भक्ति से बहुत प्रसन्न हूं। मांगो क्या मांगना चाहते हो। तब ध्रुव ने प्रभु की गोद में बैठने की इच्छा प्रकट की। इसके बाद श्रीहरि विष्णु ने उन्हें अपने गोद में बिठाया और मरणोपरांत ध्रुव तारा बनने का वरदान दिया।";

        String str3= "एक दिन, कृष्ण और उनके बड़े भाई बलराम बगीचे में फल और जामुन इकट्ठा कर रहे थे। चूंकि कृष्ण अभी भी छोटे बच्चे थे, वह पेड़ों तक नहीं पहुँच सकते थे इसलिए उन्होंने ज़मीन से मिट्टी उठाई और अपने मुंह में भर ली। दूसरे बच्चों ने यह देखा और उनकी माँ से शिकायत की, यशोदा उनके पास दौड़ीं और उन्होंने कृष्ण से पूछा कि क्या उन्होंने मिट्टी खाई है। उन्होंने ना का इशारा करते हुए सिर हिला दिया, यशोदा ने कृष्ण से मुंह खोलने के लिए कहा लेकिन वह इतना डर गए थे कि उन्होंने मुंह खोलने से इनकार कर दिया। लेकिन जब उनकी माँ ने उनकी ओर गुस्से से देखा, तो उन्होंने अपना मुंह खोल दिया।जब यशोदा ने मुंह के अंदर देखा, तो मिट्टी के बजाय उन्हें पूरा ब्रह्मांड कृष्ण के मुंह के अंदर दिखाई दिया। सितारे, आसमान, पहाड़, महासागर सब कुछ। वह आश्चर्य–चकित हो गईं और कृष्ण मुस्कुराते रहे। तब यशोदा को एहसास हुआ, कि वह कोई साधारण बालक नहीं है बल्कि स्वयं भगवान हैं।\n";

        String str4="एक बार हनुमानजी की माता अंजना बाल हनुमान को कुटी में लिटाकर कहीं बाहर चली गयीं। थोड़ी देर में हनुमानजी को बहुत तेज भूख लगी। इतने में आकाश में सूर्य भगवान उगते हुए दिखाई दिये। इन्होंने समझा कि यह कोई लाल-लाल सुंदर मीठा फल है। बस, एक ही छलांग में ये सूर्य भगवान के पास जा पहुंचे और उन्हें पकड़कर मुंह में रख लिया। सूर्य ग्रहण का दिन था। राहु सूर्य को ग्रसने के लिए उनके पास पहुंच रहा था। उसे देखकर हनुमानजी ने सोचा कि यह कोई काला फल है, इसीलिये उसकी ओर भी झपटे। राहु किसी तरह भागकर देवराज इन्द्र के पास पहुंचा। उसने कांपते हुए स्वरों में इन्द्र देव से कहा- भगवन! आज आपने यह कौन-सा दूसरा राहु सूर्य को ग्रसने के लिए भेज दिया है? यदि मैं भागा न होता तो वह मुझे भी खा गया होता।राहु की बातें सुनकर भगवान इन्द्र को बड़ा आश्चर्य हुआ। वह अपने सफेद ऐरावत हाथी पर सवार होकर हाथ में वज्र लेकर बाहर निकले। उन्होंने देखा कि एक वानर बालक सूर्य को मुंह में दबाये आकाश में खेल रहा है। हनुमान ने भी सफेद ऐरावत पर सवार इन्द्र को देखा। उन्होंने समझा कि यह भी कोई खेलने लायक सफेद फल है। वह उधर भी झपट पड़े। यह देखकर देवराज इन्द्र बहुत ही क्रोधितहो उठे। अपनी ओर झपटते हुए हनुमान से अपने को बचाया तथा सूर्य को छुड़ाने के लिए हनुमान की ठुड्डी पर वज्र का तेज प्रहार किया। वज्र के उस प्रहार से हनुमान का मुंह खुल गया और वह बेहोश होकर पृथ्वी पर गिर पड़े।हनुमान के गिरते ही उनके पिता वायु देवता भी वहां पहुंच गये। अपने बेहोश बालक को उठाकर उन्होंने छाती से लगा लिया। माता अंजना भी वहां दौड़ी हुई आ पहुंचीं। हनुमान को बेहोश देखकर वह रोने लगीं। वायु देवता ने क्रोध में आकर बहना ही बंद कर दिया। हवा के रुक जाने के कारण तीनों लोकों में सभी प्राणी व्याकुल हो उठे। पशु, पक्षी बेहोश हो होकर गिरने लगे। पेड़-पौधे और फसलें कुम्हलानें लगीं। ब्रह्माजी इन्द्र सहित सारे देवताओं को लेकर वायु देवता के पास पहुंचे। उन्होंने अपने हाथों से छूकर हनुमानजी को जीवित करते हुए वायु देवता से कहा-वायु देवता! आप तुरंत बहना शुरू करें। वायु के बिना हम सब लोगों के प्राण संकट में पड़ गये हैं। यदि आपने बहने में जरा भी देर की तो तीनों लोकों के प्राणी मौत के मुंह में चले जाएंगे। आपके इस बालक को आज सभी देवताओं की ओर से वरदान प्राप्त होगा।ब्रह्माजी की बात सुनकर सभी देवताओं ने कहा- आज से इस बालक पर किसी\n" +
                " पर के अस्त्र शस्त्र का कोई प्रभाव नहीं पड़ेगा। इन्द्र ने कहा- मेरे वज्र का प्रभाव भी अब इस पर नहीं पड़ेगा। इसकी ठुड्डी वज्र से टूट गयी थी, इसीलिये इसका नाम आज से हनुमान होगा। ब्रह्माजी ने कहा- वायुदेव! तुम्हारा यह पुत्र बल, बुद्धि, विद्या में सबसे बढ़-चढ़कर होगा। तीनों लोकों में किसी भी बात में इसकी बराबरी करने वाला कोई दूसरा नहीं होगा। यह भगवान श्रीराम का सबसे बड़ा भक्त होगा। इसका ध्यान करते ही सबके सभी प्रकार के दुःख दूर हो जाएंगे। यह मेरे ब्रह्मास्त्र के प्रभाव से सर्वथा मुक्त होगा। वरदान से प्रसन्न होकर और ब्रह्माजी एवं देवताओं की प्रार्थना सुनकर वायुदेव ने फिर पहले की तरह बहना शुरू कर दिया। तीनों लोकों के प्राणी प्रसन्न हो उठे।\n";

        String str5="एक दिन पारवती माता स्नान करने के लिए गयी लेकिन वहां पर कोई भी रक्षक नहीं था। इसलिए उन्होंने चंदन के पेस्ट से एक लड़के को अवतार दिया और उसका नाम रखा गणेश। माता पारवती नें गणेश से आदेश दिया की उनकी अनुमति के बिना किसी को भी घर के अंदर ना आने दिया जाये।जब शिवजी वापस लौटे तो उन्होंने देखा की द्वार पर एक एक बालक खड़ा है। जब वे अन्दर जाने लगे तो उस बालक नें उन्हें रोक लिया और नहीं जाने दिया। यह देख शिवजी क्रोधित हुए और अपने सवारी बैल नंदी को उस बालक से युद्ध करने को कहाँ। पर युद्ध में उस छोटे बालक नें नंदी को हरा दिया। यह देख कर भगवान शिव जी नें क्रोधित हो कर उस बाल गणेश के सर को काट दिया।अब माता पारवती वापस लौटी तो वो बहुत दुखी हुई और ज़ोर-ज़ोर से रोने लगी। शिवजी को जब पता चला की वह उनका स्वयं का पुत्र था तो उन्हें भी अपनी गलती का एहसास हुआ। शिवजी नें पारवती को बहुत समझाने का कोशिश किया पर वह नहीं मानी और गणेश का नाम लेते लेते और दुखित होने लगी।अंत में माता पारवती नें क्रोधित हो कर शिवजी को अपनी शक्ति से गणेश को दोबारा जीवित करने के लिए कहा। शिवजी बोले – हे पारवती में गणेश को जीवित तो कर सकता हूँ पर किसी भी अन्य जीवित प्राणी के सीर को जोड़ने पर ही। माता पारवती रोते-रोते बोल उठी – मुझे अपना पुत्र किसी भी हाल में जीवित चाहिए।यह सुनते ही शिवजी नें नंदी को आदेश दिया – जाओ नंदी इस संसार में जिस किसी भी जीवित प्राणी का सीर तुमको मिले काट लाना। जब नंदी सीर खोज रहा था तो सबसे पहले उससे एक हाथी दिखा तो वो उसका सीर काट कर ले आया। भगवान शिव नें उस सीर को गणेश के शारीर से जोड़ दिया और गणेश को जीवन दान दे दिया। शिवजी नें इसीलिए गणेश जी का नाम गणपति रखा और बाकि सभी देवताओं नें उन्हें वरदान दिया की इस दुनिया में जो भी कुछ नया कार्य करेगा पहले! जय श्री गणेश को याद करेगा।\n";

        //-----------------------------------------------------------------------

        String video1="https://api.vadoo.tv/landing_page?vid=1DumYfvkFaPlUNAQ08VEOBfbeswZ13f६";
        String video2="https://api.vadoo.tv/landing_page?vid=BqEYeXxqYiCKlwnWoDhRNCkPdJBC3Re5";
        String video3="https://api.vadoo.tv/landing_page?vid=vUQjBIFw2VaLjm0C1PPZnoM8lVUcJDqN";
        String video4="https://api.vadoo.tv/landing_page?vid=brkoS8RiKjzJuF६६vnx08aon5६hTK5xH";
        String video5="https://api.vadoo.tv/landing_page?vid=V2X६3yTeiMDJ8NlkIqRnLwwIF5NmcVSf";

        //-----------------------------------------------------------------------

        arrayList.add(new SpecificStoriesModel("भक्त प्रहलाद",R.drawable.narsimha,str1,video1));
        arrayList.add(new SpecificStoriesModel("ध्रुव बाल",R.drawable.dhruv,str2,video2));
        arrayList.add(new SpecificStoriesModel("कृष्ण मिट्टी खाते हैं",R.drawable.krishna,str3,video3));
        arrayList.add(new SpecificStoriesModel("नटखट हनुमान",R.drawable.hanuman,str4,video4));
        arrayList.add(new SpecificStoriesModel("भगवान गणेश",R.drawable.ganesh,str5,video5));

        //-----------------------------------------------------------------------

        SpecificSoriesAdapter specificSoriesAdapter = new SpecificSoriesAdapter(arrayList,this);

        LinearLayoutManager linearLayoutManager = new LinearLayoutManager(this,LinearLayoutManager.VERTICAL,true);
        binding.mythologicalRecyclerView.setLayoutManager(linearLayoutManager);
        binding.mythologicalRecyclerView.setAdapter(specificSoriesAdapter);
    }
}