package com.example.kahani;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.LinearLayoutManager;

import android.os.Bundle;

import com.example.kahani.Adapters.SpecificSoriesAdapter;
import com.example.kahani.Models.SpecificStoriesModel;
import com.example.kahani.databinding.ActivityPanchtantraBinding;

import java.util.ArrayList;

public class Panchtantra extends AppCompatActivity
{
    ActivityPanchtantraBinding binding;
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        binding = ActivityPanchtantraBinding.inflate(getLayoutInflater());
        setContentView(binding.getRoot());

        getSupportActionBar().hide();

        ArrayList<SpecificStoriesModel> arrayList = new ArrayList<>();
        //-----------------------------------------------------------------------

        String str1="एक बार चींटियों का दल हमेशा की तरह अपने काम में जुटा था। तभी वहां नाचता उछलता हुआ एक टिड्डा पहुंचा। टिड्डे को मस्ती करते देख चींटियों ने उसे सर्दी में आने वाले मुकिश्\u200Dलों को याद कराया। उन्होंने कहा कि वह भी काम करे नहीं ठंड में कुछ खाने को नहीं मिलेगा और पूरी ठंड ठिठुरते रहना पड़ेगा।" +
                "लेकिन टिड्डे ने उनकी एक न सुनी और उल्टे उनका ही मजाक बनाने लगा। टिड्डा, चींटियों से कहने लगा- 'आप लोग भी मेरी तरह नाचने गाने का आनंद लो क्या पूरे दिन भागदौड़ में लगी रहती हो।' " +
                "चींटियों ने कहा, 'नहीं हम मस्ती नहीं कर सकतीं क्योंकि सर्दियां आने वाली हैं और उसके लिए भोजन इकट्ठा करना है। और हमारे ख्याल से तुम्हें भी ऐसा ही करना चाहिए।" +
                "इस पर टिड्डे ने कहा, 'अभी सर्दियां बहुत दूर हैं। देखो आज कितना अच्छा मौसम है, तुम भी मेरे साथ आओ मौज मस्ती का आनंद लो।' और फिर टिड्डा गाने में जुट गया।" +
                "इधर कुछ दिन बाद ठंड का मौसम आ गया। अब टिड्डे का चेहरा मुरझाया हुआ था। क्योंकि उसने ठंड के लिए कोई तैयारी नहीं की थी। खेतो में बर्फ की चादर पड़ गई। टिड्डे के पास अब कुछ भी खाने को नहीं बचा था। भूख से मर रहे टिड्डे को अंत में उन चीटियों से खाना मांगना पड़ा जिन्हें वह कभी मौज-मस्ती की सलाह दे रहा था।" +
                "कहानी की सीख : जो अपने काम में मेहनत और लगन के साथ जुटा रहता है उसका आगे आने वाला समय आनंददायक होता है।";

        String str2="एक नदी के किनारे एक जामुन के पेड़ पर एक बन्दर रहता था. उस पेड़ पर बहुत ही मीठे-मीठे जामुन लगते थे. एक दिन एक मगरमच्छ खाना तलाशते हुए पेड़ के पास आया. बन्दर ने उससे पूछा तो उसने अपने आने की वजह बताई. बन्दर ने बताया की यहाँ बहुत ही मीठे जामुन लगते हैं और उसने वो जामुन मगरमछ को दिए. उसकी मित्रता नदी में रहने वाले मगरमच्छ के साथ हो गयी. वह बन्दर उस मगरमच्छ को रोज़ खाने के लिए जामुन देता रहता था." +
                "एकदिन उस मगरमच्छ ने कुछ जामुन अपनी पत्नी को भी खिलाये. स्वादिष्ट जामुन खाने के बाद उसने यह सोचकर कि रोज़ाना ऐसे मीठे फल खाने वाले का दिल भी खूब मीठा होगा, उसने अपने पति से कहा कि उसे उस बन्दर का दिल चाहिए और वो इसी ज़िद पर अड़ गई. उसने बीमारी का बहाना बनाया और कहा कि जब तक बन्दर का कलेजा उसे मिलेगा वो पायेगी." +
                "पत्नी कि ज़िद से मजबूर हुए मगरमच्छ ने एक चाल चली और बन्दर से कहा कि उसकी भाभी उसे मिलना चाहती है. बन्दर ने कहा कि वो भला नदी में कैसे जायेगा? मगरमच्छ ने उपाय सुझाया कि वह उसकी पीठ पर बैठ जाये, ताकि सुरक्षित उसके घर पहुँच जाए." +
                "बन्दर भी अपने मित्र की बात का भरोसा कर, पेड़ से नदी में कूदा और उसकी पीठ पर सवार हो गया. जब वे नदी के बीचों-बीच पहुंचे, मगरमच्छ ने सोचा कि अब बन्दर को सही बात बताने में कोई हानि नहीं और उसने भेद खोल दिया कि उसकी पत्नी उसका दिल खाना चाहती है. बन्दर का दिल टूट गया, उसको धक्का तो लगा, लेकिन उसने अपना धैर्य नहीं खोया." +
                "बन्दर तपाक से बोला “ओह मेरे मित्र तुमने, यह बात मुझे पहले क्यों नहीं बताई क्योंकि मैंने तो अपना दिल जामुन के पेड़ में सम्भाल कर रखा है. अब जल्दी से मुझे वापस नदी के किनारे ले चलो ताकि मैं अपना दिल लाकर अपनी भाभी को उपहार में देकर उसे खुश कर सकूं.”" +
                "मूर्ख मगरमच्छ बन्दर को जैसे ही नदी-किनारे ले कर आया बन्दर ने ज़ोर से जामुन के पेड़ पर छलांग लगाई और क्रोध में भरकर बोला, “मूर्ख ,दिल के बिना भी क्या कोई ज़िन्दा रह सकता है ? जा, आज से तेरी-मेरी दोस्ती समाप्त.”" +
                "सीख: इससे पहली यह सीख मिलती है कि मुसीबत के क्षणों में धैर्य नहीं खोना चाहिए और अनजान से दोस्ती सोच समझकर करनी चाहिए." +
                "– दूसरे, मित्रता का सदैव सम्मान करें.";

        String str3="एक बार की बात है अकबर को उनकी रानी ने कहा की आप केवल अपने दरबार में बीरबल की तारीफ करते है। मानसिंह जो की मेरा भाई है वह भी तो उतना ही बुद्धिमान है लेकिन आप उसकी इतनी तारीफ नहीं करते। अकबर ने कहा की मानसिंह भी होशियार है लेकिन बीरबल सभी वजीर में से सबसे ज़्यादा बुद्धिमान है। रानी ने कहा आप एक बार मानसिंह को मौका देकर तो देखिये। अकबर ने कहा ठीक है मै दोनों की एक परीक्षा लेता हूँ तुम देख लेना इसमें बीरबल साबित कर देंगे की वही सबसे बुद्धिमान वजीर है।" +
                "अगले दिन बादशाह अकबर ने दोनों वजीर बीरबल और मानसिंह को बुलाया और कहा आपको ईरान देश जाकर वहाँ के राजा को हमारा सन्देश देना है। वह हमारे सबसे अच्छे मित्र है इसलिए हम अपने सबसे अच्छे वजीर को वहाँ भेज रहे है।" +
                "दोनों अकबर का सन्देश लेकर ईरान के लिए रवाना हो गए। ईरान पहुंच कर उनने वहाँ के राजा को अकबर का सन्देश दिया। सन्देश पढ़ कर वह हैरान हो गए क्योंकि उसमे दोनों वजीरों को फांसी की सजा देने के लिए कहा गया था।" +
                "राजा ने अपने वजीर से इस बारे में चर्चा की वजीर ने बोला शायद ये दोनों वहाँ पर बहुत प्रसिद्ध हो इसलिए अकबर ने इनको वहाँ फांसी नहीं दी। राजा ने भी सोचा शायद ऐसा ही हो इसलिए अकबर ने हमें यह सन्देश भेजा है।" +
                "ईरान के राजा ने बीरबल और मानसिंह को बंदी बना कर कल सुबह फांसी देने को बोला। मानसिंह यह सुनकर बहुत दुखी हो गया और फांसी न देने के लिए गुजारिश करने लगा लेकिन सैनिक दोनों को बंदी बनाकर जेल में ले गए।" +
                "जेल में जाकर भी मानसिंह बहुत दुखी था उसने बीरबल को बोला हमको कल सुबह फांसी होने वाली है और तुम शांत बैठे हो और दरबार में भी तुमने ईरान के राजा से कोई फरियाद नहीं की। बीरबल बोला तुम शांत हो जाओ कल हमें फांसी नहीं होगी मै एक तरकीब बताता हूँ।" +
                "अगली सुबह सैनिक दोनों को फांसी देने के लिए लेकर गए। फांसी की जगह पर जाकर दोनों आपस में लड़ने लगे पहले मै फांसी पर चढ़ूंगा कहकर। राजा ने कहा तुम दोनों पागल हो क्या तुम जल्दी मरने के लिए क्यों लड़ रहे हो।" +
                "तब बीरबल ने कहा की हमारे धर्म गुरु ने कहा था की आज जो पहले फांसी पर चढ़ेगा वो अगले जन्म में राजा बनेगा और जो उसके बाद फांसी पर चढ़ेगा वह प्रधानमंत्री बनेगा। हमारे धर्म गुरु कभी गलत नहीं होते।" +
                "राजा ने अपने वजीर से बात की शायद इनकी बात सच हो और हमारे पास इनको फांसी पर चढाने की कोई खास वजह भी तो नहीं है। इसलिए इन दोनों को अकबर के लिए सन्देश देकर वापस भेज देते है। उनने ऐसा ही किया और दोनों को रिहा कर दिया।" +
                "अकबर के पास पहुंच कर मानसिंह ने ऐसा करने की वजह पूछी तो अकबर ने बोला मै तुम दोनों की परीक्षा ले रहा था। लेकिन तुम यह बताओ तुम दोनों वहाँ से रिहा कैसे हो गए। मानसिंह ने कहा बीरबल की बुद्धिमानी की वजह से हमारी जान बच पायी।" +
                "अकबर ने बोला मैने एक सैनिक बाद में दूसरे सन्देश के साथ भेजा था यदि वह तुमको फांसी पर लटकाने लगते तो वह सैनिक सन्देश को ईरान के राजा को दे देता।  इसके बाद सबने बीरबल की बुद्धिमानी की तारीफ की और रानी ने भी बीरबल की तारीफ की।";

        String str4="महाराज कृष्णदेवराय को तेनालीराम से बेढंगे सवाल पूछने में बड़ा ही आनंद आता था। वे हमेशा ऐसे सवाल पूछते जिसका जवाब देना हर किसी को नामुमकिन सा लगता लेकिन तेनालीराम भी हार मानने वाला नहीं था। वो भी महाराज को ऐसा जवाब देता की उन्हें कुछ समझ ही आता की वो आगे क्या पूछे। एक बार महाराज ने तेनालीराम से पूछा, “ क्या तुम अपने राज्य के कौवों की संख्या बता सकते हो ।”" +
                "तेनालीराम ने कहा , “जी महाराज , बिल्कुल बता सकता हूँ ।” कौवों की बिल्कुल सही संख्या बतानी है, ये नही की अंदाज़ा लगाकर कुछ भी बता दो। “जी महाराज मैं कौवों की बिल्कुल सही संख्या ही बताऊंगा। आप विश्वास रखें।” तेनालीराम ने कहा। महाराज बोले , “अगर तुमने गलत जवाब दिया तो तुम्हें मृत्युदंड दिया जाएगा।”" +
                "तेनालीराम ने साहस के साथ कहा , “महाराज मुझे आपका हुक्म स्वीकार है।” तेनालीराम के विरोधी मन ही मन खुश होने लगे। उन्होंने सोचा कि आज तो तेनालीराम बुरी तरह फँस चुका है। भला कौवों की गिनती कैसे की जा सकती है। तभी महाराज ने तेनालीराम से अपने सवाल का उत्तर माँगा। तेनालीराम बोला , “महाराज हमारे राज्य में एक लाख बीस हज़ार पांच सौ पचास कौवे हैं।” महाराज ने आश्चर्यचकित होकर पूछा, “ क्या हमारे राज्य में इतने कौवे हैं?” हाँ महाराज , अगर आपको यकीन नहीं तो आप गिनवा के देख सकते हैं।" +
                "“अगर गिनती में कुछ कम – ज्यादा हुए तो ।” महाराज ने कहा। ऐसा हो ही नहीं सकता। अगर ऐसा हुआ भी तो अवश्य ही हमारे राज्य के कुछ कौवे अपने रिश्तेदारों से मिलने दूसरे राज्य में गए होंगे या फिर दूसरे राज्य के कुछ कौवे हमारे राज्य में अपने रिश्तेदारों में मिलने आए होंगे। इस स्थिति में तो कौवों की संख्या कम – ज्यादा हो सकती हैं । वरना तो नहीं। तेनालीराम का उत्तर सुनकर महाराज निरुत्तर हो गए। तेनालीराम के विरोधी बेचारे हाथ मलते रह गए क्योंकि तेनालीराम ने उनकी ख़ुशी पर पानी जो फेर दिया था।";

        String str5="एक बार शहंशाह अकबर और बीरबल शिकार पर गए और वहां पर शिकार करते समय अकबर की उंगली कट गयी. अकबर को बहुत दर्द हो रहा था. पास में खड़े बीरबल ने कहा – “कोई बात नहीं शहंशाह, जो भी होता है अच्छे के लिए ही होता है.” अकबर को बीरबल की इस बात पर क्रोध आ गया और उसने अपने सैनिकों को आदेश दिया कि बीरबल को महल ले जा कर कारागाह में डाल दिया जाये. सैनिकों ने बीरबल को बंधी बना कर कारागाह में डाल दिया और अकबर अकेले ही शिकार पर आगे निकल गए. रास्ते में आदिवासियों ने जाल बिछा कर शहंशाह अकबर को बंधी बना लिया और अकबर की बली देने के लिए अपने मुखिया के पास ले गए." +
                "जैसे ही मुखिया अकबर की बली चढाने के लिए आगे बढे तो किसी ने देखा कि अकबर की तो उंगली कटी हुई है अर्थात् वह खंडित है इसलिए उसकी बली नहीं दी जा सकती और उन्होंने अकबर को मुक्त कर दिया. अकबर को अपनी गलती का अहसास हुआ और वह तुरंत बीरबल के पास पहुँचा. अकबर ने बीरबल को कारागाह से मुक्त किया और उसने बीरबल से माफ़ी मांगी कि उससे बहुत बड़ी भूल हो गयी जो उसने बीरबल जैसे ज्ञानी और दूरदृष्टि मित्र को बंधी बनाया. बीरबल ने फिर कहा – जो भी होता है अच्छे के लिए होता है. तो अकबर ने पूछा कि मेरे द्वारा तुमको बंधी बनाने में क्या अच्छा हुआ है? बीरबल ने कहा, शहंशाह अगर आप मुझे बंधी न बनाते तो में आपके साथ शिकार पर चलता और आदिवासी मेरी बली दे देते. इस तरह बीरबल की यह बात सच हुई की जो भी होता है उसका अंतिम परिणाम अच्छा ही होता है.";

        //-----------------------------------------------------------------------

        String video1="https://api.vadoo.tv/landing_page?vid=O6PsgdPDWCIHdqCEGTdk2FsPumiJyryc";
        String video2="https://api.vadoo.tv/landing_page?vid=ecr8BpRuX4EZ3xhvrVeIFH2gjR9o8hT8";
        String video3="https://api.vadoo.tv/landing_page?vid=OOFeN0xPnbfIxTsJWdi2AvjVRWJrwNHh";
        String video4="https://api.vadoo.tv/landing_page?vid=An0UXRIPZCAhaOXtm6SjBaFq19vLzBfG";
        String video5="https://api.vadoo.tv/landing_page?vid=1sYpxZsMuRY48GRXem4CPoVEeBvTS32f";

        //-----------------------------------------------------------------------

        arrayList.add(new SpecificStoriesModel("चींटी और टिड्डा",R.drawable.ant,str1,video1));
        arrayList.add(new SpecificStoriesModel("बंदर और मगरमच्छ",R.drawable.monkey,str2,video2));
        arrayList.add(new SpecificStoriesModel("फाँसी से वापसी",R.drawable.gallows,str3,video3));
        arrayList.add(new SpecificStoriesModel("कितने कौवे हैं",R.drawable.tenaliram,str4,video4));
        arrayList.add(new SpecificStoriesModel("अकबर बिरबल",R.drawable.akbar,str5,video5));

        SpecificSoriesAdapter specificSoriesAdapter = new SpecificSoriesAdapter(arrayList,this);

        LinearLayoutManager linearLayoutManager = new LinearLayoutManager(this,LinearLayoutManager.VERTICAL,true);
        binding.panchtantraRecyclerView.setLayoutManager(linearLayoutManager);
        binding.panchtantraRecyclerView.setAdapter(specificSoriesAdapter);

    }
}